# EndParameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LineSegment..::..EndParameter Property
LineSegment Class See Also
---
Parameter associated with the end point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double EndParameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EndParameter As Double
	Get
```

Visual C++
---
```text
public:
property double EndParameter {
	double get ();
}
```

# See Also
LineSegment Class
Autodesk.Revit.DB Namespace